modules/Category/Entities/Category.php

select * from `categories` where `is_active` = 1 order by -position DESC
---
    public static function tree()
    {
        $key = 'storefront:globals:' . locale() . ':categories:tree:v1';

        return Cache::store('file')->remember($key, now()->addMinutes(10), function () {
            $categories = static::with('files')
                ->select('*')
                ->selectRaw('(
                    COALESCE((
                        SELECT SUM(
                            CASE
                                WHEN products.list_variants_separately = 1 THEN (
                                    SELECT COUNT(*)
                                    FROM product_variants
                                    WHERE product_variants.product_id = products.id
                                    AND product_variants.deleted_at IS NULL
                                    AND product_variants.is_active = 1
                                )
                                ELSE 1
                            END
                        )
                        FROM product_categories
                        JOIN products ON products.id = product_categories.product_id
                        WHERE product_categories.category_id = categories.id
                        AND products.deleted_at IS NULL
                        AND products.is_active = 1
                    ), 0)
                ) as product_count')
                ->orderByRaw('-position DESC')
                ->get()
                ->nest();