modules/Product/Entities/ProductVariant.php

select * from `products` where `products`.`id` = 39 and `is_active` = 1 limit 1
select * from `products` where `products`.`id` = 36 limit 1
update `product_variants` set `qty` = 3, `product_variants`.`updated_at` = '2025-12-23 23:17:36' where `id` = 53
---
    protected static function booted()
    {
        static::addActiveGlobalScope();

        static::saved(function ($productVariant) {
            $productVariant->withoutEvents(function () use ($productVariant) {
                $productVariant->update([
                    'selling_price' => ($productVariant->hasSpecialPrice() ? $productVariant->getSpecialPrice() : $productVariant->price)->amount(),
                ]);
            });

            try {
                $product = $productVariant->product()->withoutGlobalScope('active')->first();
                if ($product) {
                    $sumQty = (float) $product->variants()
                        ->withoutGlobalScope('active')
                        ->where('is_active', true)
                        ->sum('qty');
                    $product->withoutEvents(function () use ($product, $sumQty) {
                        $product->update(['qty' => $sumQty]);
                    });
                }
            } catch (\Throwable $e) {
            }
        });