modules/Cart/Storages/Database.php

select * from `carts` where `carts`.`id` = 'JcRDMS6sVoSCKnpLb0PsiJ5XyMTZNw8ZPKzjbNON_cart_items' limit 1
---
    public function get($key)
    {
        $normalizedKey = $this->normalizeKey($key);

        if (!array_key_exists($normalizedKey, self::$rowCache)) {
            self::$rowCache[$normalizedKey] = Cart::find($normalizedKey);

select * from `carts` where `carts`.`id` = 'zKCzRCKDP8nfVILkkikBBFxV1YH2W0UG4TTgzXEA_cart_items' limit 1
---
    public function put($key, $value)
    {
        $normalizedKey = $this->normalizeKey($key);

        if ($row = Cart::find($normalizedKey)) {