modules/Cart/CartItem.php

    private function getVariant()
    {
        $id = (int) ($this->variant->id ?? 0);

        if ($id <= 0) {
            return null;
        }

        if (!array_key_exists($id, self::$variantStockCache)) {
            self::$variantStockCache[$id] = ProductVariant::query()
                ->without(['files'])
                ->addSelect('id', 'in_stock', 'manage_stock', 'qty', 'is_active')
                ->where('id', $id)
                ->first();
---
select `id`, `in_stock`, `manage_stock`, `qty`, `is_active` from `product_variants` where `id` = 60 and `product_variants`.`deleted_at` is null and `is_active` = 1 limit 1