modules/Cart/Cart.php

    public function store($productId, $variantId, $qty, $options = []): void
    {
        $options = array_filter($options);
        $variations = [];

        $product = Product::with('files', 'categories', 'taxClass')->findOrFail($productId);
---
select * from `tax_classes` where `tax_classes`.`id` in (1) and `tax_classes`.`deleted_at` is null