modules/Cart/CartItem.php

    private function getVariant()
    {
        return ProductVariant::addSelect('id', 'in_stock', 'manage_stock', 'qty', 'is_active')
            ->where('id', $this->variant->id)
            ->first();
---
select `id`, `in_stock`, `manage_stock`, `qty`, `is_active` from `product_variants` where `id` = 50 and `product_variants`.`deleted_at` is null and `is_active` = 1 limit 1