modules/Product/Repositories/ProductRepository.php

select * from `units` where `units`.`id` in (1)
select `options`.*, `product_options`.`product_id` as `pivot_product_id`, `product_options`.`option_id` as `pivot_option_id` from `options` inner join `product_options` on `options`.`id` = `product_options`.`option_id` where `product_options`.`product_id` in (37) order by `position` asc
select `tags`.*, `product_tags`.`product_id` as `pivot_product_id`, `product_tags`.`tag_id` as `pivot_tag_id` from `tags` inner join `product_tags` on `tags`.`id` = `product_tags`.`tag_id` where `product_tags`.`product_id` in (37)
select `variations`.*, `product_variations`.`product_id` as `pivot_product_id`, `product_variations`.`variation_id` as `pivot_variation_id` from `variations` inner join `product_variations` on `variations`.`id` = `product_variations`.`variation_id` where `product_variations`.`product_id` in (37) order by `position` asc
---
    public static function findBySlug($slug)
    {
        return Product::withCount('reviews')
            ->withAvg('reviews', 'rating')
            ->with([
                'meta',
                'brand',
                'primaryCategory',
                'saleUnit',
                'productMedia' => function ($q) {
                    $q->active()->orderBy('position');
                },
                'variations',
                'variations.values',
                'variations.values.files',
                'variants',
                'variants.files',
                'categories',
                'tags',
                'attributes.attribute.attributeSet',
                'options',
                'files',
            ])
            ->where('slug', $slug)
            ->firstOrFail();