modules/SizeChart/Services/SizeChartResolver.php

    private function resolveAllForProductUncached(Product $product): Collection
    {
        $product->loadMissing(['tags']);

        $productOverrides = SizeChart::query()
            ->withoutGlobalScope('active')
            ->where('is_active', true)
            ->whereHas('assignments', function ($q) use ($product) {
                $q->where('assignable_type', Product::class)
                    ->where('assignable_id', $product->id);
            })
            ->with(['assignments' => function ($q) use ($product) {
                $q->where('assignable_type', Product::class)
                    ->where('assignable_id', $product->id)
                    ->orderByDesc('priority')
                    ->orderByDesc('id');
            }])
            ->get()
            ->sortByDesc(function (SizeChart $chart) {
                return optional($chart->assignments->first())->priority ?? 0;
            })
            ->values();

        if ($productOverrides->isNotEmpty()) {
            return $productOverrides;
        }

        if (! is_null($product->primary_category_id)) {
            $categoryMatches = SizeChart::query()
                ->withoutGlobalScope('active')
                ->where('is_active', true)
                ->whereHas('assignments', function ($q) use ($product) {
                    $q->where('assignable_type', Category::class)
                        ->where('assignable_id', $product->primary_category_id);
                })
                ->with(['assignments' => function ($q) use ($product) {
                    $q->where('assignable_type', Category::class)
                        ->where('assignable_id', $product->primary_category_id)
                        ->orderByDesc('priority')
                        ->orderByDesc('id');
                }])
                ->get()
                ->sortByDesc(function (SizeChart $chart) {
                    return optional($chart->assignments->first())->priority ?? 0;
                })
                ->values();
---
select * from `size_charts` where `is_active` = 1 and exists (select * from `size_chart_assignments` where `size_charts`.`id` = `size_chart_assignments`.`size_chart_id` and `assignable_type` = 'Modules\\Product\\Entities\\Product' and `assignable_id` = 39)
select * from `size_charts` where `is_active` = 1 and exists (select * from `size_chart_assignments` where `size_charts`.`id` = `size_chart_assignments`.`size_chart_id` and `assignable_type` = 'Modules\\Category\\Entities\\Category' and `assignable_id` = 12)

            return collect();
        }

        return SizeChart::query()
            ->withoutGlobalScope('active')
            ->where('is_active', true)
            ->whereHas('assignments', function ($q) use ($tagIds) {
                $q->where('assignable_type', Tag::class)
                    ->whereIn('assignable_id', $tagIds);
            })
            ->with(['assignments' => function ($q) use ($tagIds) {
                $q->where('assignable_type', Tag::class)
                    ->whereIn('assignable_id', $tagIds)
                    ->orderByDesc('priority')
                    ->orderByDesc('id');
            }])
            ->get()
            ->sortByDesc(function (SizeChart $chart) {
                return optional($chart->assignments->first())->priority ?? 0;
            })
            ->values();
---
select * from `size_charts` where `is_active` = 1 and exists (select * from `size_chart_assignments` where `size_charts`.`id` = `size_chart_assignments`.`size_chart_id` and `assignable_type` = 'Modules\\Tag\\Entities\\Tag' and `assignable_id` in (5, 6, 7))