modules/Storefront/Http/Controllers/ProductIndexController.php

    protected function getProducts($settingPrefix)
    {
        $this->variantsMode = setting("{$settingPrefix}_variants_mode") ?: 'inherit';
        $type = setting("{$settingPrefix}_product_type", 'custom_products');
        $limit = setting("{$settingPrefix}_products_limit");

        if ($type === 'all_products') {
            return Product::forCard()
                ->with([
                    'variants',
                    'saleUnit',
                    'variations',
                    'tags',
                    'tags.tagBadges' => function ($query) {
                        $query->active();
                    },
                ])
                ->when(!is_null($limit), function ($q) use ($limit) {
                    $q->limit($limit);
                })
                ->get()
                ->flatMap(function (Product $product) {
                    $tagBadges = $product->badgeVisualsFor('listing')->map(function ($badge) {
                        return [
                            'name' => $badge->name,
                            'image_url' => $badge->image_url,
                            'listing_position' => $badge->listing_position,
                            'detail_position' => $badge->detail_position,
                            'priority' => $badge->priority,
                        ];
                    })->values();

                    $variantLabel = optional($product->variations->first())->name;

                    $shouldListSeparately = (bool) $product->list_variants_separately;
                    if ($this->variantsMode === 'force_on') {
                        $shouldListSeparately = true;
                    } elseif ($this->variantsMode === 'force_off') {
                        $shouldListSeparately = false;
                    }
---
select * from `units` where `units`.`id` in (1)
select `tags`.*, `product_tags`.`product_id` as `pivot_product_id`, `product_tags`.`tag_id` as `pivot_tag_id` from `tags` inner join `product_tags` on `tags`.`id` = `product_tags`.`tag_id` where `product_tags`.`product_id` in (19, 36, 37, 38)
select `variations`.*, `product_variations`.`product_id` as `pivot_product_id`, `product_variations`.`variation_id` as `pivot_variation_id` from `variations` inner join `product_variations` on `variations`.`id` = `product_variations`.`variation_id` where `product_variations`.`product_id` in (19, 36, 37, 38) order by `position` asc