modules/Product/Listeners/IncrementProductView.php

        }

        if ($shouldIncrement) {
            Product::withoutTimestamps(fn () => $event->product->increment('viewed'));
---
update `products` set `viewed` = `viewed` + 1 where `id` = 39