modules/Product/Listeners/SendBackInStockNotifications.php

    private function handleVariant(ProductVariant $variant): void
    {
        if (! $variant->isInStock()) {
            Log::info('[STOCK_NOTIFY] variant not in stock; skipping', [
                'variant_id' => $variant->id,
                'manage_stock' => $variant->manage_stock,
                'qty' => $variant->qty,
                'in_stock' => $variant->in_stock,
            ]);
            return;
        }

        $product = $variant->product()->withoutGlobalScope('active')->first();

        if (! $product) {
            return;
        }

        $product->setRelation('variants', $product->variants()->withoutGlobalScope('active')->get());

        if (! $product->isInStock()) {
            return;
        }

        $pending = StockNotifyRequest::query()
            ->whereNull('sent_at')
            ->where(function ($q) use ($variant, $product) {
                $q->where('variant_id', $variant->id)
                    ->orWhere(function ($q) use ($product) {
                        $q->where('product_id', $product->id)
                            ->whereNull('variant_id');
                    });
            })
            ->get();
---
select * from `products` where `products`.`id` = 36 limit 1
select * from `stock_notify_requests` where `sent_at` is null and (`variant_id` = 50 or (`product_id` = 36 and `variant_id` is null))