modules/Admin/Http/Controllers/Admin/CartActivityController.php

    public function index(Request $request)
    {
        $payload = Cache::remember('admin:dashboard:cart_activity:v2', now()->addSeconds(20), function () {
            $base = DB::table('carts')
                ->where('id', 'like', '%_cart_items');

            $now = now();

            $computeWindow = function ($since) use ($base) {
                $count = (clone $base)
                    ->where('updated_at', '>=', $since)
                    ->count();

                $sampleRows = (clone $base)
                    ->where('updated_at', '>=', $since)
                    ->orderByDesc('updated_at')
                    ->limit(50)
                    ->get(['data']);
---
select count(*) as aggregate from `carts` where `id` like '%_cart_items' and `updated_at` >= '2025-12-24 00:54:41'
select `data` from `carts` where `id` like '%_cart_items' and `updated_at` >= '2025-12-24 00:54:41' order by `updated_at` desc limit 50

            $today = $computeWindow($now->copy()->startOfDay());

            $computeVisits = function ($since) {
                return (int) DB::table('page_views')
                    ->where('created_at', '>=', $since)
                    ->distinct('fingerprint')
                    ->count('fingerprint');
---
select count(distinct `fingerprint`) as aggregate from `page_views` where `created_at` >= '2025-12-24 00:54:41'