modules/Admin/Http/Controllers/Admin/DashboardController.php

select * from `products` where `manage_stock` = 1 and `in_stock` = 1 and `qty` is not null and `qty` > 0 and `qty` <= 5 order by `qty` asc limit 10
---
    private function getLowStockProducts(): array
    {
        $threshold = 5;
        $limit = 10;

        $variants = ProductVariant::query()
            ->withoutGlobalScope('active')
            ->where('is_active', true)
            ->where('manage_stock', true)
            ->where('in_stock', true)
            ->whereNotNull('qty')
            ->where('qty', '>', 0)
            ->where('qty', '<=', $threshold)
            ->with(['product' => function ($q) {
                $q->withoutGlobalScope('active')->with(['saleUnit', 'files']);
            }])
            ->orderBy('qty')
            ->limit($limit)
            ->get();