modules/Admin/Http/Controllers/Admin/DashboardAnalyticsController.php

select DATE_FORMAT(c.last_order_at, '%Y-%m') as date, SUM(CASE WHEN c.first_order_at >= '2025-11-28 00:00:00' THEN 1 ELSE 0 END) as new_customers, SUM(CASE WHEN c.first_order_at < '2025-11-28 00:00:00' THEN 1 ELSE 0 END) as returning_customers from (select COALESCE(CAST(customer_id AS CHAR), CONCAT('email:', customer_email)) as customer_key, MIN(created_at) as first_order_at, MAX(created_at) as last_order_at from `orders` where `status` not in ('canceled', 'refunded') and `orders`.`deleted_at` is null group by `customer_key`) as `c` where `c`.`last_order_at` between '2025-11-28 00:00:00' and '2025-12-23 23:59:59' group by DATE_FORMAT(c.last_order_at, '%Y-%m') order by DATE_FORMAT(c.last_order_at, '%Y-%m') asc
---
    private function newVsReturningCustomers(Carbon $start, Carbon $end, string $group)
    {
        $sub = Order::query()
            ->withoutCanceledOrders()
            ->selectRaw("COALESCE(CAST(customer_id AS CHAR), CONCAT('email:', customer_email)) as customer_key")
            ->selectRaw('MIN(created_at) as first_order_at')
            ->selectRaw('MAX(created_at) as last_order_at')
            ->groupBy('customer_key');

        $dateExpr = $group === 'month'
            ? "DATE_FORMAT(c.last_order_at, '%Y-%m')"
            : 'DATE(c.last_order_at)';

        return DB::query()
            ->fromSub($sub, 'c')
            ->whereBetween('c.last_order_at', [$start, $end])
            ->selectRaw("{$dateExpr} as date")
            ->selectRaw('SUM(CASE WHEN c.first_order_at >= ? THEN 1 ELSE 0 END) as new_customers', [$start])
            ->selectRaw('SUM(CASE WHEN c.first_order_at < ? THEN 1 ELSE 0 END) as returning_customers', [$start])
            ->groupBy(DB::raw($dateExpr))
            ->orderBy(DB::raw($dateExpr))
            ->get();

select x.product_id as product_id, x.product_variant_id as product_variant_id, MAX(x.product_name) as product_name, MAX(x.product_image_path) as product_image_path, MAX(x.unit_label) as unit_label, MAX(x.unit_short_suffix) as unit_short_suffix, MAX(pv.name) as variant_name, MAX(x.variant_label) as variant_label, SUM(x.qty) as orders_qty, SUM(x.line_total) as revenue from (select op.id as order_product_id, op.product_id as product_id, op.product_variant_id as product_variant_id, MAX(op.product_name) as product_name, MAX(op.product_image_path) as product_image_path, MAX(op.unit_label) as unit_label, MAX(op.unit_short_suffix) as unit_short_suffix, op.qty as qty, op.line_total as line_total, GROUP_CONCAT(DISTINCT opv.value ORDER BY opv.id SEPARATOR ' / ') as variant_label from `order_products` as `op` inner join `orders` as `o` on `o`.`id` = `op`.`order_id` left join `order_product_variations` as `opv` on `opv`.`order_product_id` = `op`.`id` where `o`.`deleted_at` is null and `o`.`status` not in ('canceled', 'refunded') and `o`.`created_at` between '2025-11-25 00:00:00' and '2025-12-24 23:59:59' group by `op`.`id`, `op`.`product_id`, `op`.`product_variant_id`, `op`.`qty`, `op`.`line_total`) as `x` left join `product_variants` as `pv` on `pv`.`id` = `x`.`product_variant_id` group by `x`.`product_id`, `x`.`product_variant_id`, `x`.`variant_label` order by `orders_qty` desc limit 10
---
    private function topProducts(Carbon $start, Carbon $end, int $limit = 10): array
    {
        $items = DB::table('order_products as op')
            ->join('orders as o', 'o.id', '=', 'op.order_id')
            ->leftJoin('order_product_variations as opv', 'opv.order_product_id', '=', 'op.id')
            ->whereNull('o.deleted_at')
            ->whereNotIn('o.status', [Order::CANCELED, Order::REFUNDED])
            ->whereBetween('o.created_at', [$start, $end])
            ->selectRaw('op.id as order_product_id')
            ->selectRaw('op.product_id as product_id')
            ->selectRaw('op.product_variant_id as product_variant_id')
            ->selectRaw('MAX(op.product_name) as product_name')
            ->selectRaw('MAX(op.product_image_path) as product_image_path')
            ->selectRaw('MAX(op.unit_label) as unit_label')
            ->selectRaw('MAX(op.unit_short_suffix) as unit_short_suffix')
            ->selectRaw('op.qty as qty')
            ->selectRaw('op.line_total as line_total')
            ->selectRaw("GROUP_CONCAT(DISTINCT opv.value ORDER BY opv.id SEPARATOR ' / ') as variant_label")
            ->groupBy('op.id', 'op.product_id', 'op.product_variant_id', 'op.qty', 'op.line_total')

            ;

        $rows = DB::query()
            ->fromSub($items, 'x')
            ->leftJoin('product_variants as pv', 'pv.id', '=', 'x.product_variant_id')
            ->selectRaw('x.product_id as product_id')
            ->selectRaw('x.product_variant_id as product_variant_id')
            ->selectRaw('MAX(x.product_name) as product_name')
            ->selectRaw('MAX(x.product_image_path) as product_image_path')
            ->selectRaw('MAX(x.unit_label) as unit_label')
            ->selectRaw('MAX(x.unit_short_suffix) as unit_short_suffix')
            ->selectRaw('MAX(pv.name) as variant_name')
            ->selectRaw('MAX(x.variant_label) as variant_label')
            ->selectRaw('SUM(x.qty) as orders_qty')
            ->selectRaw('SUM(x.line_total) as revenue')
            ->groupBy('x.product_id', 'x.product_variant_id', 'x.variant_label')
            ->orderByDesc('orders_qty')
            ->limit($limit)
            ->get();

select * from `products` where `id` in (19)
select * from `product_variants` where `id` in (26, 29, 28, 27, 23, 43, 14, 13, 44)
select * from `products` where 0 = 1
select * from `product_variants` where 0 = 1
---
        $productIds = $rows->pluck('product_id')->filter()->unique()->values()->all();
        $variantIds = $rows->pluck('product_variant_id')->filter()->unique()->values()->all();

        $productsById = Product::query()
            ->withoutGlobalScope('active')
            ->withBaseImage()
            ->whereIn('id', $productIds)
            ->get()
            ->keyBy('id');

        $variantsById = ProductVariant::query()
            ->withoutGlobalScope('active')
            ->withTrashed()
            ->withBaseImage()
            ->whereIn('id', $variantIds)
            ->get()
            ->keyBy('id');

        return $rows
            ->map(function ($row) use ($productsById, $variantsById) {
                $productId = $row->product_id ? (int) $row->product_id : null;
                $variantId = $row->product_variant_id ? (int) $row->product_variant_id : null;

                $productName = (string) ($row->product_name ?? '');
                $variantName = (string) ($row->variant_name ?? '');
                $variantLabel = (string) ($row->variant_label ?? '');

                $displayName = $productName;
                $displayVariant = $variantLabel !== '' ? $variantLabel : $variantName;

                $product = $productId ? $productsById->get($productId) : null;
                $variant = $variantId ? $variantsById->get($variantId) : null;

                $imageUrl = null;

                if (!$imageUrl) {
                    $imageUrl = $this->normalizeImageUrl($row->product_image_path ?: null);
                }
