modules/Admin/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `products`
---
    public function index()
    {
        return view('admin::dashboard.index', [
            'totalSales' => Order::totalSales(),
            'totalOrders' => Order::withoutCanceledOrders()->count(),
            'totalProducts' => Product::withoutGlobalScope('active')->count(),

select * from `search_terms` order by `updated_at` desc limit 5
---
    private function getLatestSearchTerms()
    {
        return SearchTerm::latest('updated_at')->take(5)->get();

select `id`, `customer_first_name`, `customer_last_name`, `payment_method`, `total`, `status`, `created_at` from `orders` where `orders`.`deleted_at` is null order by `created_at` desc limit 15
---
    private function getLatestOrders()
    {
        return Order::select([
            'id',
            'order_number',
            'customer_first_name',
            'customer_last_name',
            'payment_method',
            'total',
            'status',
            'created_at',
        ])->latest()->take(15)->get();

select `users`.`id` as `id`, `users`.`first_name` as `first_name`, `users`.`last_name` as `last_name`, `users`.`email` as `email`, COUNT(orders.id) as orders_count, SUM(orders.total) as total_spent from `orders` inner join `users` on `users`.`id` = `orders`.`customer_id` where `orders`.`customer_id` is not null and `orders`.`status` not in ('canceled', 'refunded') group by `orders`.`customer_id`, `users`.`id`, `users`.`first_name`, `users`.`last_name`, `users`.`email` order by SUM(orders.total) desc limit 10
---
    private function getTopCustomers()
    {
        return DB::table('orders')
            ->join('users', 'users.id', '=', 'orders.customer_id')
            ->whereNotNull('orders.customer_id')
            ->whereNotIn('orders.status', [Order::CANCELED, Order::REFUNDED])
            ->groupBy('orders.customer_id', 'users.id', 'users.first_name', 'users.last_name', 'users.email')
            ->orderByDesc(DB::raw('SUM(orders.total)'))
            ->limit(10)
            ->get([
                'users.id as id',
                'users.first_name as first_name',
                'users.last_name as last_name',
                'users.email as email',
                DB::raw('COUNT(orders.id) as orders_count'),
                DB::raw('SUM(orders.total) as total_spent'),
            ]);

select * from `product_variants` where `is_active` = 1 and `manage_stock` = 1 and `in_stock` = 1 and `qty` is not null and `qty` > 0 and `qty` <= 5 and `product_variants`.`deleted_at` is null order by `qty` asc limit 10
select * from `products` where `products`.`id` in (36)
select * from `units` where `units`.`id` in (1)
---
    private function getLowStockProducts(): array
    {
        $threshold = 5;
        $limit = 10;

        $variants = ProductVariant::query()
            ->withoutGlobalScope('active')
            ->where('is_active', true)
            ->where('manage_stock', true)
            ->where('in_stock', true)
            ->whereNotNull('qty')
            ->where('qty', '>', 0)
            ->where('qty', '<=', $threshold)
            ->with(['product' => function ($q) {
                $q->withoutGlobalScope('active')->with(['saleUnit', 'files']);
            }])
            ->orderBy('qty')
            ->limit($limit)
            ->get();

select * from `products` where `manage_stock` = 1 and `in_stock` = 1 and `qty` is not null and `qty` > 0 and `qty` <= 5 order by `qty` asc limit 9
---

        $remaining = $limit - count($rows);

        $products = Product::query()
            ->withoutGlobalScope('active')
            ->with(['saleUnit', 'files'])
            ->where('manage_stock', true)
            ->where('in_stock', true)
            ->whereNotNull('qty')
            ->where('qty', '>', 0)
            ->where('qty', '<=', $threshold)
            ->orderBy('qty')
            ->limit($remaining)
            ->get();