modules/Admin/Http/Controllers/Admin/EnhancedDashboardAnalyticsController.php

    public function topCategories(Carbon $start, Carbon $end, int $limit = 10): array
    {
        $loc = app()->getLocale();
        $fallbackCategories = DB::table('product_categories')->selectRaw('product_id, MIN(category_id) as fallback_category_id')->groupBy('product_id');
        $rows = DB::table('order_products as op')
            ->join('orders as o', 'o.id', '=', 'op.order_id')
            ->join('products as p', 'p.id', '=', 'op.product_id')
            ->leftJoinSub($fallbackCategories, 'pc', function ($join) { $join->on('pc.product_id', '=', 'p.id'); })
            ->leftJoin('category_translations as ct', function ($join) use ($loc) { $join->on('ct.category_id', '=', DB::raw('COALESCE(p.primary_category_id, pc.fallback_category_id)'))->where('ct.locale', '=', $loc); })
            ->whereNull('o.deleted_at')->whereNotIn('o.status', [Order::CANCELED, Order::REFUNDED])->whereBetween('o.created_at', [$start, $end])
            ->whereRaw('COALESCE(p.primary_category_id, pc.fallback_category_id) IS NOT NULL')
            ->selectRaw('COALESCE(p.primary_category_id, pc.fallback_category_id) as category_id')->selectRaw('MAX(ct.name) as name')->selectRaw('SUM(op.qty) as orders_qty')->selectRaw('SUM(op.line_total) as revenue')
            ->groupBy(DB::raw('COALESCE(p.primary_category_id, pc.fallback_category_id)'))->orderByDesc(DB::raw('SUM(op.qty)'))->limit($limit)->get();
        return $rows->map(function ($r) { return ['category_id' => (int) $r->category_id, 'name' => (string) ($r->name ?: ('#' . (int) $r->category_id)), 'orders_qty' => (float) $r->orders_qty, 'revenue' => (float) $r->revenue]; })->values()->all();
---
select HOUR(created_at) as hour, COUNT(*) as orders, SUM(total) as revenue from `orders` where `status` not in ('canceled', 'refunded') and `created_at` between '2025-11-28 00:00:00' and '2025-12-23 23:59:59' and `orders`.`deleted_at` is null group by HOUR(created_at) order by HOUR(created_at) asc