modules/Admin/Http/Controllers/Admin/EnhancedDashboardAnalyticsController.php

select p.primary_category_id as category_id, MAX(ct.name) as name, SUM(op.qty) as orders_qty, SUM(op.line_total) as revenue from `order_products` as `op` inner join `orders` as `o` on `o`.`id` = `op`.`order_id` inner join `products` as `p` on `p`.`id` = `op`.`product_id` left join `category_translations` as `ct` on `ct`.`category_id` = `p`.`primary_category_id` and `ct`.`locale` = 'tr' where `o`.`deleted_at` is null and `o`.`status` not in ('canceled', 'refunded') and `o`.`created_at` between '2025-11-25 00:00:00' and '2025-12-24 23:59:59' and `p`.`primary_category_id` is not null group by `p`.`primary_category_id` order by SUM(op.qty) desc limit 10
---
    private function topCategories(Carbon $start, Carbon $end, int $limit = 10): array
    {
        $loc = locale();

        $fallbackCategories = DB::table('product_categories')
            ->selectRaw('product_id, MIN(category_id) as fallback_category_id')
            ->groupBy('product_id');

        $rows = DB::table('order_products as op')
            ->join('orders as o', 'o.id', '=', 'op.order_id')
            ->join('products as p', 'p.id', '=', 'op.product_id')
            ->leftJoinSub($fallbackCategories, 'pc', function ($join) {
                $join->on('pc.product_id', '=', 'p.id');
            })
            ->leftJoin('category_translations as ct', function ($join) use ($loc) {
                $join->on('ct.category_id', '=', DB::raw('COALESCE(p.primary_category_id, pc.fallback_category_id)'))
                    ->where('ct.locale', '=', $loc);
            })
            ->whereNull('o.deleted_at')
            ->whereNotIn('o.status', [Order::CANCELED, Order::REFUNDED])
            ->whereBetween('o.created_at', [$start, $end])
            ->whereRaw('COALESCE(p.primary_category_id, pc.fallback_category_id) IS NOT NULL')
            ->selectRaw('COALESCE(p.primary_category_id, pc.fallback_category_id) as category_id')
            ->selectRaw('MAX(ct.name) as name')
            ->selectRaw('SUM(op.qty) as orders_qty')
            ->selectRaw('SUM(op.line_total) as revenue')
            ->groupBy(DB::raw('COALESCE(p.primary_category_id, pc.fallback_category_id)'))
            ->orderByDesc(DB::raw('SUM(op.qty)'))
            ->limit($limit)
            ->get();

select p.brand_id as brand_id, MAX(bt.name) as name, SUM(op.qty) as orders_qty, SUM(op.line_total) as revenue from `order_products` as `op` inner join `orders` as `o` on `o`.`id` = `op`.`order_id` inner join `products` as `p` on `p`.`id` = `op`.`product_id` left join `brand_translations` as `bt` on `bt`.`brand_id` = `p`.`brand_id` and `bt`.`locale` = 'tr' where `o`.`deleted_at` is null and `o`.`status` not in ('canceled', 'refunded') and `o`.`created_at` between '2025-11-25 00:00:00' and '2025-12-24 23:59:59' and `p`.`brand_id` is not null group by `p`.`brand_id` order by SUM(op.qty) desc limit 10
select HOUR(created_at) as hour, COUNT(*) as orders, SUM(total) as revenue from `orders` where `status` not in ('canceled', 'refunded') and `created_at` between '2025-11-25 00:00:00' and '2025-12-24 23:59:59' and `orders`.`deleted_at` is null group by HOUR(created_at) order by HOUR(created_at) asc
---
    private function topBrands(Carbon $start, Carbon $end, int $limit = 10): array
    {
        $loc = locale();

        $rows = DB::table('order_products as op')
            ->join('orders as o', 'o.id', '=', 'op.order_id')
            ->join('products as p', 'p.id', '=', 'op.product_id')
            ->leftJoin('brand_translations as bt', function ($join) use ($loc) {
                $join->on('bt.brand_id', '=', 'p.brand_id')
                    ->where('bt.locale', '=', $loc);
            })
            ->whereNull('o.deleted_at')
            ->whereNotIn('o.status', [Order::CANCELED, Order::REFUNDED])
            ->whereBetween('o.created_at', [$start, $end])
            ->whereNotNull('p.brand_id')
            ->selectRaw('p.brand_id as brand_id')
            ->selectRaw('MAX(bt.name) as name')
            ->selectRaw('SUM(op.qty) as orders_qty')
            ->selectRaw('SUM(op.line_total) as revenue')
            ->groupBy('p.brand_id')
            ->orderByDesc(DB::raw('SUM(op.qty)'))
            ->limit($limit)
            ->get();

        return $rows
            ->map(function ($r) {
                return [
                    'brand_id' => (int) $r->brand_id,
                    'name' => (string) ($r->name ?: ('#' . (int) $r->brand_id)),
                    'orders_qty' => (float) $r->orders_qty,
                    'revenue' => (float) $r->revenue,
                ];
            })
            ->values()
            ->all();