modules/User/Entities/User.php

select count(*) as aggregate from `users` inner join `user_roles` on `users`.`id` = `user_roles`.`user_id` where `user_roles`.`role_id` = 2
---
    public static function totalCustomers()
    {
        return Role::findOrNew(setting('customer_role'))->users()->count();