modules/FlashSale/Entities/FlashSale.php

select * from `flash_sales` where `id` = '1' limit 1
---
    public static function activeCampaign($id)
    {
        self::$active = function () use ($id) {
            return once(function () use ($id) {
                $locale = function_exists('locale') ? locale() : app()->getLocale();

                return Cache::store('file')->remember(
                    "storefront:globals:{$locale}:flash_sale:campaign:{$id}:v1",
                    now()->addMinutes(10),
                    function () use ($id) {
                        return self::withEligibleProducts()->where('id', $id)->firstOrNew([]);
                    }
                );