modules/Product/Transformers/ProductEditResource.php

    public function toArray($request): array
    {
        return [
            'id' => $this->id,
            'slug' => $this->slug,
            'name' => $this->name,
            'description' => $this->description,
            'short_description' => $this->short_description,
            'google_product_category_path' => $this->google_product_category_path,
            'list_variants_separately' => (bool) $this->list_variants_separately,
            'brand_id' => $this->brand_id ?? '',
            'sale_unit_id' => $this->sale_unit_id ?? '',
            'unit_suffix' => $this->saleUnit ? $this->saleUnit->getDisplaySuffix() : '',
            'unit_min' => $this->saleUnit ? (float) $this->saleUnit->min : 0,
            'unit_step' => $this->saleUnit ? (float) $this->saleUnit->step : 1,
            'unit_decimal' => $this->saleUnit ? (bool) $this->saleUnit->is_decimal_stock : false,
            'categories' => $this->categories->pluck('id'),
            'primary_category_id' => $this->primary_category_id,
            'tags' => $this->tags->pluck('id'),
            'attributes' => ProductAttributeResource::collection($this->attributes),
            'variations' => VariationResource::collection($this->variations()->orderBy('position')->get()),
            'options' => OptionResource::collection($this->options),
            'variants' => ProductVariantResource::collection($this->variants()->withoutGlobalScope('active')->orderBy('position')->get()),
            'media' => collect([])
                ->concat($this->filterFiles('base_image')->get()->map->only('id', 'path'))
                ->concat($this->filterFiles('additional_images')->get()->map->only('id', 'path'))
                ->values()
                ->all(),
            'product_media' => $this->productMedia()->orderBy('position')->get(['id','product_id','variant_id','type','path','poster','position','is_active']),
---
select `variations`.*, `product_variations`.`product_id` as `pivot_product_id`, `product_variations`.`variation_id` as `pivot_variation_id` from `variations` inner join `product_variations` on `variations`.`id` = `product_variations`.`variation_id` where `product_variations`.`product_id` = 38 order by `position` asc, `position` asc
select `id`, `product_id`, `variant_id`, `type`, `path`, `poster`, `position`, `is_active` from `product_media` where `product_media`.`product_id` = 38 and `product_media`.`product_id` is not null order by `position` asc, `position` asc