modules/Product/Http/Controllers/ProductController.php

                }

                // Normal kategori yoksa, dinamik kategori dene
                $dynamicCategory = DynamicCategory::where('slug', $categorySlug)->first();
---
select * from `dynamic_categories` where `slug` = 'SLUG' limit 1

    public function upsell($id)
    {
        $productId = (int) $id;
        $locale = locale();

        $cacheKey = "storefront:product:{$productId}:upsell:{$locale}:v2";

        return Cache::store('file')->remember($cacheKey, now()->addMinutes(5), function () use ($productId) {
            $product = Product::query()->select(['id'])->findOrFail($productId);

            $items = $product->upSellProducts()
                ->with(['variants', 'brand.translations', 'saleUnit', 'tags'])
                ->withAvg('reviews', 'rating')
                ->forCard()
                ->take(8)
                ->get();
---
select * from `units` where `units`.`id` in (1)