modules/Product/Http/Controllers/ProductSearch.php

        $badgesByTagId = collect();

        if ($allTagIds->isNotEmpty()) {
            $badgesByTagId = TagBadge::query()
                ->active()
                ->where('show_on_listing', true)
                ->whereIn('tag_id', $allTagIds)
                ->orderByDesc('priority')
                ->get()
                ->groupBy('tag_id');
---
select * from `tag_badges` where `is_active` = 1 and `show_on_listing` = 1 and `tag_id` in (6, 10, 1, 7, 2, 5, 8, 11, 9, 3, 4) order by `priority` desc