modules/Storefront/Http/ViewComposers/ProductShowPageComposer.php

select * from `categories` where `id` in (20)
---
    private function categoryTrail($category)
    {
        try {
            $levels = 0;
            $frontier = collect([(int) $category->id]);
            $all = collect();

            while ($frontier->isNotEmpty() && $levels++ < 10) {
                $chunk = \Modules\Category\Entities\Category::withoutGlobalScope('active')
                    ->whereIn('id', $frontier->all())
                    ->get();