modules/Category/Http/Controllers/CategoryProductController.php

    public function index($slug, Product $model, ProductFilter $productFilter)
    {
        request()->merge(['category' => $slug]);

        // Önce dinamik kategoriye bak (aynı slug varsa dinamik kategori öncelikli olsun)
        $dynamicCategory = DynamicCategory::where('slug', $slug)->first();
---
select * from `dynamic_categories` where `slug` = 'tekstil' limit 1