modules/Media/Jobs/GenerateResponsiveImagesForMedia.php

select * from `files` where `files`.`id` = 204 limit 1
---
    public function handle(ResponsiveImageGenerator $generator): void
    {
        $file = MediaFile::find($this->fileId);